## WTF is a library...?

Simply but, its a bunch of functions and objects someone else built that you can easily use.

# How to handle data in python using Pandas. 
Pandas is like Excel, but does not suck.  Anything you need to do with data, you can do with pandas.  Im going to focus on the 20% of the things that do 80% of the work.

In [ ]:
import pandas as pd
import numpy as np

# Importing data
* If data is seperated by `;`, change to `sep=';'`
* Shift+Tab is your best friend

In [4]:
# read in the csv file and store it as a variable named 'df'
path_to_data_file = '../data/prices.csv'
df = pd.read_csv(filepath_or_buffer=path_to_data_file)

# display just the first 5 rows
df.head()

  neighbourhood_group   mean_price
0               Bronx        92.75
1            Brooklyn       120.22
2           Manhattan       191.88
3              Queens        99.75
4       Staten Island       110.94

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   neighbourhood_group  5 non-null      object
 1    mean_price          5 non-null      float64
dtypes: float64(1), object(1)
memory usage: 212.0+ bytes

In [6]:
df.describe()

       mean_price
count     5.00000
mean    123.10800
std      39.85346
min      92.75000
25%      99.75000
50%     110.94000
75%     120.22000
max     191.88000

In [ ]:
# Lots of options you can set in the pd.set_option class. 
# I am not going to go into this just wanted to show you that it exists
# pd.set_option?
# pd.set_option('display.float_format', lambda x: '%.2f' % x)
# df.describe()

In [ ]:
# on purpose error yo!
path_to_listings_data = 'data/listings.csv'
df = pd.read_csv(path_to_listings_data)
df.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,175,3,48,2019-11-04,0.37,2,365
1,3831,"Whole flr w/private bdrm, bath & kitchen(pls r...",4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,75,1,340,2020-08-01,4.75,1,265
2,5121,BlissArtsSpace!,7356,Garon,Brooklyn,Bedford-Stuyvesant,40.68688,-73.95596,Private room,60,29,50,2019-12-02,0.37,1,365
3,5136,"Spacious Brooklyn Duplex, Patio + Garden",7378,Rebecca,Brooklyn,Sunset Park,40.66120,-73.99423,Entire home/apt,175,14,1,2014-01-02,0.01,1,295
4,5178,Large Furnished Room Near B'way,8967,Shunichi,Manhattan,Hell's Kitchen,40.76489,-73.98493,Private room,65,2,473,2020-03-15,3.44,1,340

# Let's find out how to see the 'shape' of our data...

In [10]:
print(df.shape, len(df))
df.head()

(46527, 16) 46527

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,175,3,48,2019-11-04,0.37,2,365
1,3831,"Whole flr w/private bdrm, bath & kitchen(pls r...",4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,75,1,340,2020-08-01,4.75,1,265
2,5121,BlissArtsSpace!,7356,Garon,Brooklyn,Bedford-Stuyvesant,40.68688,-73.95596,Private room,60,29,50,2019-12-02,0.37,1,365
3,5136,"Spacious Brooklyn Duplex, Patio + Garden",7378,Rebecca,Brooklyn,Sunset Park,40.66120,-73.99423,Entire home/apt,175,14,1,2014-01-02,0.01,1,295
4,5178,Large Furnished Room Near B'way,8967,Shunichi,Manhattan,Hell's Kitchen,40.76489,-73.98493,Private room,65,2,473,2020-03-15,3.44,1,340

# Basic Syntax
* Select one column
* Select multiple columns
   * Must use a list

In [11]:
# SELECT ONE COLUMN
df['name']

0                                    Skylit Midtown Castle
1        Whole flr w/private bdrm, bath & kitchen(pls r...
2                                          BlissArtsSpace!
3                 Spacious Brooklyn Duplex, Patio + Garden
4                         Large Furnished Room Near B'way
                               ...
46522           Designer Gramercy Studio Townhouse by UNSQ
46523    Cozy & comfy apt in the heart of Inwood Manhattan
46524    Comfortable safe environment 24hr security camera
46525                   Upper West Side studio 86th Street
46526    5MIN D/N trains, NEAR THE BEACH, 50’ TO MANHATTAN
Name: name, Length: 46527, dtype: object

In [15]:
# SELECT MULTIPLE COLUMNS
# Talk about the index 'column'.., 
cols_to_select = ['id', 'name']

df[ cols_to_select ]

             id                                               name
0          2595                              Skylit Midtown Castle
1          3831  Whole flr w/private bdrm, bath & kitchen(pls r...
2          5121                                    BlissArtsSpace!
3          5136           Spacious Brooklyn Duplex, Patio + Garden
4          5178                   Large Furnished Room Near B'way
...         ...                                                ...
46522  44807522         Designer Gramercy Studio Townhouse by UNSQ
46523  44807786  Cozy & comfy apt in the heart of Inwood Manhattan
46524  44811717  Comfortable safe environment 24hr security camera
46525  44814944                 Upper West Side studio 86th Street
46526  44818009  5MIN D/N trains, NEAR THE BEACH, 50’ TO MANHATTAN

[46527 rows x 2 columns]

In [16]:
df_just_two_cols = df[cols_to_select]
df_just_two_cols

             id                                               name
0          2595                              Skylit Midtown Castle
1          3831  Whole flr w/private bdrm, bath & kitchen(pls r...
2          5121                                    BlissArtsSpace!
3          5136           Spacious Brooklyn Duplex, Patio + Garden
4          5178                   Large Furnished Room Near B'way
...         ...                                                ...
46522  44807522         Designer Gramercy Studio Townhouse by UNSQ
46523  44807786  Cozy & comfy apt in the heart of Inwood Manhattan
46524  44811717  Comfortable safe environment 24hr security camera
46525  44814944                 Upper West Side studio 86th Street
46526  44818009  5MIN D/N trains, NEAR THE BEACH, 50’ TO MANHATTAN

[46527 rows x 2 columns]

In [13]:
df.tail(3)

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
46524,44811717,Comfortable safe environment 24hr security camera,362453686,Nicole,Brooklyn,East Flatbush,40.65399,-73.93287,Private room,59,3,0,NaN,NaN,1,90
46525,44814944,Upper West Side studio 86th Street,4039777,Fernando,Manhattan,Upper West Side,40.78731,-73.97029,Entire home/apt,80,30,0,NaN,NaN,1,113
46526,44818009,"5MIN D/N trains, NEAR THE BEACH, 50’ TO MANHATTAN",48098268,Marina,Brooklyn,Gravesend,40.59945,-73.98209,Private room,66,1,0,NaN,NaN,1,38

# Basic Math
Lets say we wanted to up the price 100x

In [ ]:
df['new_price'] = df['price'] * 100
df.head(2)

In [ ]:
df['price'].mean()

Let's find the minimum booking amout by multiplying price by minimum_nights
* note, you can also access columns by using a dot `.`

In [ ]:
df['min_booking_amount'] = df['price'] * df['minimum_nights']
df.head(2)

# NOTE show how df is in local memory not in CSV yet.

---
# If time nice to have

In [ ]:
# Create our select condition.
select_condition = df['neighbourhood_group'] == 'Manhattan'


# Talk about what this is.  A boolean mask. 
select_condition

In [ ]:
# Making a new data frame of just Manhattan
select_condition = df['neighbourhood_group'] == 'Manhattan'

df_manhattan = df[ select_condition ]
df_manhattan.head()

In [ ]:
# SIDE NOTE INTERRUPTION
## MY FAVORITE POANDAS FUNCTION .value_counts()
# This is great for sanity checks

df.neighbourhood_group.value_counts()

In [ ]:
df_manhattan.neighbourhood_group.value_counts()

# Using more than one filter / selector

In [ ]:
# Select Brooklyn
condition_1 = df['neighbourhood_group'] == 'Brooklyn'

# Select Prices that are higher than 500
condition_2 = df['price'] > 500

# Select all data that meets both requirments
bk_high = df[ condition_1 & condition_2 ]
bk_high.head()

## Using 'or' statments
* What if we want to find all listings in Midtown or DUMBO
* The 'or' in python is the pipe thing `|`

In [ ]:
condition_1 = df.neighbourhood == 'Midtown'

condition_2 = df.neighbourhood == 'DUMBO'

# Select all data that meets condition 1 or condition 2
df[ condition_1 | condition_2]['neighbourhood'].value_counts()

# Why doesn't this work..?

In [ ]:
# Why doesn't this work..?

condition_1 = df.neighbourhood == 'Midtown'

condition_2 = df.neighbourhood == 'DUMBO'

# Select all data that meets condition 1 or condition 2
df[ condition_1 & condition_2]

## Using `.isin`. A very handy selector tool.

In [ ]:
# List of neighborhoods we want to select
neighborhoods = ['Midtown', 'DUMBO', 'Queens']

# Create our select condition aka 'boolean mask'
condition = df.neighbourhood.isin(neighborhoods)

# Display the filtered data
df[condition]['neighbourhood'].value_counts()

In [ ]:
list_of_hoods = ['Sunnyside', 'Woodside']

select_statement = df.neighbourhood.isin(list_of_hoods)

df[select_statement]

In [ ]:
# How would we do a sanity check and see if it only selected Sunnside and Woodside?
## ASK STUDENTS.

In [ ]:
# Inverse selections

list_of_hoods = ['Sunnyside', 'Woodside']

select_statement = df.neighbourhood.isin(list_of_hoods)


# using the '~' will tell it to select the opposite/inverse of the select statement.
df[~select_statement].head()

# Assigning values to filtered columns using `np.where()`
* np.where is a handy tool that takes in a condition statement, followed by what value to set when condition is true, and then what value to set when condition is false.  
* `np.where(condition, when_true, when_false)`

### We want a new column that whenever a listing is in Williamsburg, set it equal to 1, else, 0.

In [ ]:
# c1 = df['neighbourhood'] == 'Williamsburg'
c1 = df['min_booking_amount'] > 100

df['is_expensive'] = np.where( c1, 'expensive', 'cheap')

df.head()

In [ ]:
# You can do it with multiple conditions as well...

# First select condition.
c1 = df['neighbourhood'] == 'Williamsburg'

# Second select condition.
c2 = df['room_type'] == 'Private room'

# Set equal to one when both conditions are true, and zero when not true.
df['private_room_in_williamsburg'] =  np.where( c1 & c2, 1, 0 )

# Sanity check to view if our assignment worked correctly.
select_statement = df['private_room_in_williamsburg'] == 1

new_df = df[  select_statement ]

df['select_statement'] = select_statement

df.head()

# Applying a functions to a column // skip to Grouping if running low on time.

In [ ]:
def half_number(input_number):
    output_number = input_number / 2
    return output_number

In [ ]:
df.head()

In [ ]:
df['sale_price'] = df['price'].apply(half_number )
df.head()

In [ ]:
# How to select just places that are furnished.

def my_function(x):
    if 'Furnished' in str(x):
        return 1
    else:
        return 0

df['is_furnished'] = df['name'].apply( my_function )

df.head()

# Grouping

<img src='https://i.stack.imgur.com/sgCn1.jpg'>

In [ ]:
df.head().T

Doing a groupby does nothing unless you apply a function to a column of the groupby object.

In [ ]:
group_by_object = df.groupby('neighbourhood_group')
print(group_by_object)

## After the groupby, select a column then select the function you want to perform on said column.

In [ ]:
gb = df.groupby('neighbourhood_group')
print(gb)

gb['price'].mean()

# You can use `.agg` to do multiple functions on said column.

In [ ]:
gb = df.groupby('neighbourhood_group')
gb['price'].agg( ['count', 'min', 'max', 'mean', 'median', 'std', 'sum'] )

# You can only groupy by categorical values. And you can only apply the aggerate function to continous values.

# Double groupby

In [ ]:
groupby_cols = ['neighbourhood_group', 'room_type']
gb = df.groupby(groupby_cols)
gb['price'].mean()

# Making a DataFrame out of a groupby 
* This is somewhat nuanced, but something I find people struggle on and is very handy to know how to do.

In [ ]:
# Do your group by
gb = df.groupby('neighbourhood_group')['price'].mean()
# # # Convert it to a DataFrame
new_df = pd.DataFrame(gb)

# # # # # Reset the index
new_df = new_df.reset_index()

# # # # Check it out
new_df

# Very helpful tools
* `df.describe()`
* `df.info`
* `df.shape`
* `df['column'].value_counts()`
* `df['column'].apply(function)`
* `df.dropna(subset=[columns])`

In [ ]:
df.describe()

In [ ]:
df.head()

In [ ]:
df.info()

# How to find percentages of the whole using `value_counts`

In [ ]:
dfv = df.neighbourhood_group.value_counts() 
dfv

In [ ]:
dfp = df.neighbourhood_group.value_counts(normalize=True) 
dfp

# Joins

![Image](https://i.stack.imgur.com/UI25E.jpg)

# In pandas its MERGE not JOIN for some odd reason.

In [ ]:
dfprices = pd.read_csv('data/prices.csv')
dfprices

In [ ]:
# Why is this funky and how do we fix it
dflistings = pd.read_csv('data/n_listings.csv')
dflistings

In [ ]:
# Merge defaults to an inner-join
new_df = pd.merge(dfprices, dflistings, on='neighbourhood_group')
new_df

In [ ]:
# Doing a outer join keeps all values in the left table
dfjoined = pd.merge(dfprices, 
                    dflistings, 
                    on='neighbourhood_group', 
                    how='left')

dfjoined

In [ ]:
pd.merge??

# Exporting data
* Almost always use `index=False` when saving your csv

In [ ]:
# This is the name of your new file
save_as = 'my-data-file.csv'

# This is the method you use, DONT FORGET INDEX=FALSE!
dfjoined.to_csv(save_as, index=False)

In [ ]:
# Another fun way to get your data out.
dfjoined.to_clipboard(index=False)